SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( MT_DB_Cl101_BlGr_DMCL_SC51521
Comment (Non MSTSBin )
 Type ( Engine )
        WagonShape ( MT_DB_101_DMCL.s )
        Size ( 3.594m 4.431m 17.351m )
        Mass ( 36t )        comment( 66139lb )
 WheelRadius ( 18in )
 InertiaTensor ( Box ( 3.594m 4.431m 17.351m ) )
  
  FreightAnim ( "MT_DB_101_DMCL-SC51521.s" 0.0 6.1 0.0 )
  
 Coupling (
  Type ( Automatic )
  Spring (
   Stiffness ( 1e5N/m 5e5N/m )
   Damping ( 1e8N/m/s 1e8N/m/s )
   Break ( 2e9N 2e9N )
   r0 ( 5cm 10cm )
  )
  Velocity ( 0.1m/s )
  CouplingHasRigidConnection ( 1 )
 )
 Buffers (
  Spring (
   Stiffness ( 1e6N/m 1e9N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   r0 ( 0m 1e9 )
  )
  Centre ( 0.5m )
  Radius ( 1m )
  Angle ( 0.5deg )
 )

 Adheasion ( 0.2 0.4 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 75kN )
 DerailBufferForce ( 150kN )
 NumWheels ( 4 )
 Friction (
  100N/m/s  1  -1mph  0  1
  5.1N/rad/s  1  -1rad/s  0  1
 )

 AntiSlip ()

 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_twin_pipe" )
 MaxBrakeForce( 40kN )
 MaxReleaseRate( 4 )
 MaxApplicationRate( 4 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )
 
 IntakePoint ( 3.33 0.4 FuelDiesel )
 
 PassengerCapacity ( 56.0 )

  
 Sound ( "..\\..\\MT_Common.Sound\\Railwaves\\117Sound\\wsr_117_eng.sms" )

 Lights ( 8
 
 Light (
   comment( Right White Marker Light Dim & Bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffdd )
     Position ( 0.88 1.51 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.30 )
     Elevation ( 0 0 0 )
     )
    )
   )
  Light (
   comment( Left White Marker Light Dim & Bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffdd )
     Position ( -0.88 1.51 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.40 )
     Elevation ( 0 0 0 )
     )
    )
   )
   
 Light (
   comment( Right Red Marker Light Dim & Bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 4 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ff0000 )
     Position ( 0.88 1.45 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.20 )
     Elevation ( 0 0 0 )
     )
    )
   )
   
  Light (
   comment( Left Red Marker Light Dim & Bright )
   Type  ( 0 )
   Conditions (
    Headlight ( 4 )
    Unit ( 4 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ff0000 )
     Position ( -0.88 1.45 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.20 )
     Elevation ( 0 0 0 )
     )
    )
   )

comment ( ** AI Lights ** )
 Light (
   comment( Right White Marker Light AI)
   Type  ( 0 )
   Conditions (
   Control ( 1 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffdd )
     Position ( 0.88 1.51 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.30 )
     Elevation ( 0 0 0 )
     )
    )
   )
  Light (
   comment( Left White Marker Light AI)
   Type  ( 0 )
   Conditions (
   Control ( 1 )
    Unit ( 2 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ffffdd )
     Position ( -0.88 1.51 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.40 )
     Elevation ( 0 0 0 )
     )
    )
   )
   
 Light (
   comment( Right Red Marker Light AI)
   Type  ( 0 )
   Conditions (
   Service ( 2 )
    Unit ( 3 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ff0000 )
     Position ( 0.88 1.45 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.20 )
     Elevation ( 0 0 0 )
     )
    )
   )
   
  Light (
   comment( Left Red Marker Light AI)
   Type  ( 0 )
   Conditions (
   Service ( 2 )
    Unit ( 3 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( 80ff0000 )
     Position ( -0.88 1.45 8.46)
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.20 )
     Elevation ( 0 0 0 )
     )
    )
   )
 
  )

)

Engine ( MT_DB_Cl101_BlGr_DMCL_SC51521
Effects
 (
  DieselSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   Exhaust1
   (
                                0.55 3.65 -8.46
    0 1 0
    0.15
   )
   Exhaust2
   (
                                -0.55 3.65 -8.46
    0 1 0
    0.15
   )
  )
        )
 Wagon ( MT_DB_Cl101_BlGr_DMCL_SC51521 )
 Type ( Diesel )
MaxPower (  300hp )
 MaxForce ( 95kN )
 MaxContinuousForce ( 80kN )
 MaxVelocity ( 75mph )
 WheelRadius ( 18in )
 NumWheels ( 1 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )
 MaxDieselLevel( 500gals )
 
 TrainBrakesControllerMaxApplicationRate( 5 )
 TrainBrakesControllerMaxReleaseRate( 5 )
 TrainBrakesControllerEmergencyApplicationRate( 15 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 1 )
 TrainBrakesControllerFullServicePressureDrop( 25 )
 AirBrakesIsCompressorElectricOrMechanical ( 0 )
 AirBrakesCompressorRestartPressure ( 28 )
 TrainPipeLeakRate (0.5)

 BrakeEquipmentType ( "Vacuum_brake, Handbrake, " )
 BrakeSystemType ( "Vacuum_twin_pipe" )
 CabView ( "..\\..\\MT_Common.cabs\\Railwaves\\117Cab\\wsr_117_cab.cvf" )


 DieselEngineType ( hydraulic )

 MaxDieselLevel ( 500gal )
 DieselUsedPerHourAtMaxPower ( 35gal )
 DieselUsedPerHourAtIdle ( 6gal )

 DieselSmokeEffectInitialMagnitude( 0.75 )
 DieselSmokeEffectMaxMagnitude( 1.1 )

 DieselSmokeEffectInitialSmokeRate( 0.2 )
 DieselSmokeEffectMaxSmokeRate( 2.1 )

 DieselEngineIdleRPM( 500 )
 DieselEngineStallRPM( 100 )
 DieselEngineMaxRPM( 1900 )
 DieselEngineSpeedOfMaxTractiveEffort( 13mph )
 DieselEngineMaxRPMChangeRate( 60 )

 GearBoxNumberOfGears( 4 )
 GearBoxDirectDriveGear( 4 )
 GearBoxMaxSpeedForGears( 15 27 41 80)
 GearBoxMaxTractiveForceForGears( 35000N 25000N 17000N 12000N )
 GearBoxOverspeedPercentageForFailure( 170 )
 GearBoxBackLoadForce( 0 )
 GearBoxCoastingForce( 0 )
 GearBoxOperation( manual )
    GearBoxEngineBraking( none )
 GearBoxUpGearProportion( 0.85 )
 GearBoxDownGearProportion( 0.35 )


 AWSMonitor(
  MonitoringDeviceMonitorTimeLimit( -1 )
  MonitoringDeviceAlarmTimeLimit( 5 )
  MonitoringDevicePenaltyTimeLimit( 0 )
  MonitoringDeviceCriticalLevel( 0 )
  MonitoringDeviceResetLevel( 0 )
  MonitoringDeviceAppliesFullBrake( 0 )
  MonitoringDeviceAppliesEmergencyBrake( 1 )
  MonitoringDeviceAppliesCutsPower( 0 )
  MonitoringDeviceAppliesShutsDownEngine( 0 )
  )

        EngineControllers (
            Throttle ( 0 1 0.25 0 
                NumNotches ( 5 
                  Notch ( 0         0 Dummy )
                  Notch ( 0.25       0 Dummy )
                  Notch ( 0.5       0 Dummy )
                  Notch ( 0.75       0 Dummy )
                  Notch ( 1         0 Dummy )
                )
            )
           
            Brake_Train ( 0 1 0.03 0.75
                NumNotches( 3
                    Notch(0     1 TrainBrakesControllerReleaseStart )
                    Notch(0.39   1 TrainBrakesControllerRunningStart )
                    Notch(0.51   1 TrainBrakesControllerApplyStart )
                )
            )
            EngineBrakingButton( 0 1 0 )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            Gear( 0 4 1 0
                NumNotches ( 5 
                Notch ( 0         0 Dummy )
                Notch ( 1         0 Dummy )
                Notch ( 2         0 Dummy )
       Notch ( 3         0 Dummy )
       Notch ( 4         0 Dummy )
                )
            )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
        )
        Name ( "MT Class 101 BlueGrey DMCL SC51521" )
          Description (
 "Built by Met Cam from 1956, the Class 101 DMUs became the longest serving DMU's ever built. Lasting longer than British Rail itself.\n "+ 
 "By 1959 more than 700 coaches had been built of this class.\n"+
 "The last units finally were withdrawn from main-line service at the end of 2003, after 50 years of service.\n\n"+
 "Locomotive type: Diesel-Mechanical Multiple Unit (DMMU)\n\n"+
 "Power source: 2x BUT (AEC/Leyland) 150hp 6-cylinder diesel engine\n\n"+
 "Power: 300 hp\n\n"+
 "Max. speed: 70 mph (110 km/h)\n\n"+
 "Height: 12 ft. 5 in. (3.77 m)\n\n"+
 "Width: 9 ft. 1 in. (2.74 m)\n\n"+
 "Length: 59 ft. (17 m)\n\n"+
 "Weight: 36 metric tons (39.7 U.S. tons)\n\n"+
 "Wheel configuration: Eight wheels in 1A-A1 configuration (one driven axle per bogie)"
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Move vacuum brake handle to release (by pressing the “;” key) until 15” of vacuum is created in the brake pipe.\n"+
 "2.   Move the direction selector forward by pressing “W”.\n"+
 "3. Press “E” to engage first gear.\n"+
 "4.   Release the brake completely.\n"+
 "5. When the unit begins to move, open the throttle by pressing “D”.\n\n"+
 "Gears\n"+
 "1. Gear speeds: 1st Gear 1 to 15 mph; 2nd Gear 15 to 27 mph; 3rd Gear 27 to 41mph; 4th Gear 41 to 65 mph.\n"+
 "2. 4th Gear is the direct drive gear, and should be used for coasting at all times.\n"+
 "3. To change up the gears, bring the throttle to idle by pressing “S”, then change up by pressing “E”.\n"+
 "4.   To change down the gears, bring the throttle to idle by pressing “S”, then change down by pressing “Shift + E”.\n"+
 "5. The unit should be placed in idle just before coming to a stand.\n\n"+
 "Brakes\n"+
 "1. This unit is fitted with a twin-pipe vacuum brake system.\n"+
 "2. The brake handle has three ranges – release, running and apply.\n"+
 "3. With the handle in the release position (hold down “ ; ”) the train-pipe is connected to the vacuum exhauster and reservoir. This causes a vacuum to be created in the train pipe, releasing the brakes.\n"+
 "4.   With the handle in the running position, the brake pipe is isolated both from the vacuum exhauster and atmospheric pressure.  The current brake pipe vacuum will be maintained.\n"+
 "5. With the handle in the apply position (hold down the “ APOSTOPHE” key) atmospheric pressure is admitted into the train-pipe, causing the brakes to apply.\n\n"
 )
 Sound ( "..\\..\\MT_Common.Sound\\Railwaves\\117Sound\\wsr_117_cab.sms" )
)
